# Warsztaty Python w Data Science

## Data Wrangling z Biblioteką Pandas 
### Część 1 z 5 - wprowadzenie

***

# https://github.com/Bits-of-Data-PL/PythonDataScience

***

## Data Wrangling 1
- Data wrangling, munging, tidying
- Biblioteka Pandas – wprowadzenie
- Wybieranie wierszy
- Formatowanie

---
## Zadanie 1 

Posortować `dluga_lista` po wartości bezwględnej elementów listy interpretowanych jako wartość całkowita

In [1]:
dluga_lista = [ str(i) for i in range(21)] + [ str(i) for i in range(-1, -21, -1)]
str(dluga_lista)

"['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '-1', '-2', '-3', '-4', '-5', '-6', '-7', '-8', '-9', '-10', '-11', '-12', '-13', '-14', '-15', '-16', '-17', '-18', '-19', '-20']"

In [2]:
abs(-1)

1

In [3]:
abs('-1')

TypeError: bad operand type for abs(): 'str'

In [4]:
def bezwzgledna(x):
    x = float(x)
    return x if x > 0 else -x

In [5]:
bezwzgledna('-1')

1.0

In [6]:
dluga_lista.sort(key=bezwzgledna)
str(dluga_lista)

"['0', '1', '-1', '2', '-2', '3', '-3', '4', '-4', '5', '-5', '6', '-6', '7', '-7', '8', '-8', '9', '-9', '10', '-10', '11', '-11', '12', '-12', '13', '-13', '14', '-14', '15', '-15', '16', '-16', '17', '-17', '18', '-18', '19', '-19', '20', '-20']"

In [7]:
dluga_lista =  [ str(i) for i in range(-1, -21, -1)] + [ str(i) for i in range(21)]
str(dluga_lista)

"['-1', '-2', '-3', '-4', '-5', '-6', '-7', '-8', '-9', '-10', '-11', '-12', '-13', '-14', '-15', '-16', '-17', '-18', '-19', '-20', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20']"

In [ ]:
dluga_lista.sort(key=bezwzgledna)
str(dluga_lista)

In [ ]:
def bezwzgledna(x):
    x = float(x)
    return (x, x if x > 0 else -x)

## Zadanie 2

Wygenerować listę liczb z zakresu `1-1000` które nie są podzielne przez żadną cyfrę od `2` do `9`.

In [8]:
[ (num,[div for div in range(2,10) if num%div == 0])  for num in range(1,21)]

[(1, []),
 (2, [2]),
 (3, [3]),
 (4, [2, 4]),
 (5, [5]),
 (6, [2, 3, 6]),
 (7, [7]),
 (8, [2, 4, 8]),
 (9, [3, 9]),
 (10, [2, 5]),
 (11, []),
 (12, [2, 3, 4, 6]),
 (13, []),
 (14, [2, 7]),
 (15, [3, 5]),
 (16, [2, 4, 8]),
 (17, []),
 (18, [2, 3, 6, 9]),
 (19, []),
 (20, [2, 4, 5])]

``` python
[num for num in range(1,1001) if not [div for div in range(2,10) if num%div == 0]]
```

In [9]:
str([num for num in range(1,1001) if not [div for div in range(2,10) if num%div == 0]][:21])

'[1, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89]'

In [10]:
str([num for num in range(1,1001) if not [div for div in range(2,10) if num%div == 0]][-20:])

'[911, 913, 919, 923, 929, 937, 941, 943, 947, 949, 953, 961, 967, 971, 977, 979, 983, 989, 991, 997]'

## Zadanie 3

Stworz funkcję która usunie "wyplaszczy" zagnieżdzone listy

l = [4, 1, [ 2, [7] ], 3]

wyplaszcz(l)

l

[4, 1, 2, 7, 3]

In [11]:
def wyplaszcz(lista):
    ret = []
    for x in lista:
        if type(x)==type([]):
            for y in wyplaszcz(x):
                ret.append(y)
        else:
            ret.append(x)
    return ret

In [12]:
l = [4, 1, [ 2, [7] ], 3]
l = wyplaszcz(l)
l

[4, 1, 2, 7, 3]

In [13]:
def wyplaszcz(lista):
    kopia = list(lista)
    for i in range(len(lista)-1,-1,-1):
        del lista[i]
    for x in kopia:
        if type(x)==type([]):
            for y in wyplaszcz(x):
                lista.append(y)
        else:
            lista.append(x)
    return lista

In [14]:
l = [4, 1, [ 2, [7] ], 3]
wyplaszcz(l)
l

[4, 1, 2, 7, 3]

***

![](img/road.jpg)

## Data Wrangling, Munging, Tidying

### Data Wrangling
- __Discovering__ (eksploracja danych)
- __Structuring__ (przygotowanie danych do konkretnego zadania)
- __Cleaning__ (ujednolicenie danych, usuwanie danych niepotrzebnych itd.)
- Enriching (łączenie danych)
- Validating (sprawdzenie poprawności merytorycznej)
- Publishing (publikacja wyników)

źródło: https://www.onlinewhitepapers.com/information-technology/six-core-data-wrangling-activities/

## Tidy Data

Wickham, Hadley - _"Tidy Data"_
https://www.jstatsoft.org/index.php/jss/article/view/v059i10/v59i10.pdf

- __Each variable you measure should be in one column.__
- __Each different observation of that variable should be in a different row.__
- There should be one table for each "kind" of variable.
- If you have multiple tables, they should include a column in the table that allows them to be linked.

## Pandas

https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

In [15]:
import pandas

In [16]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions',
                 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}

In [17]:
import pandas 

football = pandas.DataFrame(data)
print (football)

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [18]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [19]:
football.describe()

              year       wins     losses
count     8.000000   8.000000   8.000000
mean   2011.125000   9.375000   6.625000
std       0.834523   3.377975   3.377975
min    2010.000000   4.000000   1.000000
25%    2010.750000   7.500000   5.000000
50%    2011.000000  10.000000   6.000000
75%    2012.000000  11.000000   8.500000
max    2012.000000  15.000000  12.000000

In [20]:
football.dtypes

year       int64
team      object
wins       int64
losses     int64
dtype: object

In [21]:
football.head()

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5

In [22]:
football.tail()

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [25]:
football.sample(5)

   year     team  wins  losses
4  2012  Packers    11       5
0  2010    Bears    11       5
1  2011    Bears     8       8
6  2011    Lions    10       6
3  2011  Packers    15       1

In [26]:
football['year']

0    2010
1    2011
2    2012
3    2011
4    2012
5    2010
6    2011
7    2012
Name: year, dtype: int64

In [27]:
football.year

0    2010
1    2011
2    2012
3    2011
4    2012
5    2010
6    2011
7    2012
Name: year, dtype: int64

In [28]:
football[['year', 'team', 'wins']]

   year     team  wins
0  2010    Bears    11
1  2011    Bears     8
2  2012    Bears    10
3  2011  Packers    15
4  2012  Packers    11
5  2010    Lions     6
6  2011    Lions    10
7  2012    Lions     4

---

## Row Selection
### Wybieranie wierszy

1. Slicing
2. Individual index (iloc / loc)
3. Boolean indexing
4. Combination

### Slicing

In [29]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [30]:
football[3:5]

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5

### Individual index

### Iloc
- An integer, e.g. 5.
- A list or array of integers, e.g. [4, 3, 0].
- A slice object with ints, e.g. 1:7.
- A boolean array.
- A function

In [31]:
football.iloc[[0,3]]

   year     team  wins  losses
0  2010    Bears    11       5
3  2011  Packers    15       1

### Loc
- A single label
- A list or array of labels, e.g. ['a', 'b', 'c'].
- A slice object with labels, e.g. 'a':'f' __(WARNING - both the start and the stop are included)__ 
- A boolean array
- A callable function

In [32]:
import numpy as np
import pandas as pd

index = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=['A', 'B', 'C'])
df

                   A         B         C
2000-01-01 -1.095227 -2.173282 -0.367219
2000-01-02  0.660062  1.540461 -0.745741
2000-01-03  2.088378 -1.045437 -0.217719
2000-01-04  1.834816 -1.605575  1.697272
2000-01-05  0.079391  1.598117  0.709488
2000-01-06 -0.240125 -0.847581 -1.171186
2000-01-07  0.958691  1.141735  0.131745
2000-01-08  1.799966 -0.915102 -0.153541

In [33]:
df.loc['2000-01-03']

A    2.088378
B   -1.045437
C   -0.217719
Name: 2000-01-03 00:00:00, dtype: float64

In [34]:
df.loc['2000-01-03': '2000-01-04']

                   A         B         C
2000-01-03  2.088378 -1.045437 -0.217719
2000-01-04  1.834816 -1.605575  1.697272

### Boolean indexing

In [35]:
football[football.wins > 10]

   year     team  wins  losses
0  2010    Bears    11       5
3  2011  Packers    15       1
4  2012  Packers    11       5

### Combination

In [36]:
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [37]:
football[(football.wins > 10) & (football.team == "Packers")]

   year     team  wins  losses
3  2011  Packers    15       1
4  2012  Packers    11       5

In [38]:
football[(football.wins > 10) | (football.team == "Packers")]

   year     team  wins  losses
0  2010    Bears    11       5
3  2011  Packers    15       1
4  2012  Packers    11       5

***

## Formatowanie

In [39]:
import numpy as np
import pandas as pd

index = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=['A', 'B', 'C'])
df

                   A         B         C
2000-01-01 -0.905308 -0.393136 -1.003778
2000-01-02 -0.470104 -0.769813 -0.456002
2000-01-03 -0.560115  0.086272 -0.725329
2000-01-04  0.959598  1.296840 -1.868739
2000-01-05  0.115898 -1.240031 -1.615287
2000-01-06 -0.012749  1.930775  1.321410
2000-01-07 -0.029404 -0.186048  1.017959
2000-01-08 -0.174316 -0.079513 -0.393982

In [40]:
df.values

array([[-0.90530761, -0.39313558, -1.00377824],
       [-0.47010366, -0.76981267, -0.45600241],
       [-0.56011454,  0.08627152, -0.72532857],
       [ 0.95959834,  1.29684027, -1.86873902],
       [ 0.11589781, -1.24003116, -1.6152871 ],
       [-0.01274867,  1.93077512,  1.32140961],
       [-0.02940415, -0.18604793,  1.01795863],
       [-0.17431648, -0.07951308, -0.39398244]])

In [41]:
df.index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [42]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [43]:
newcols = []
for i in range(len(df.columns)):
    newcols.append(df.columns[i].lower())
df.columns = newcols

In [44]:
df

                   a         b         c
2000-01-01 -0.905308 -0.393136 -1.003778
2000-01-02 -0.470104 -0.769813 -0.456002
2000-01-03 -0.560115  0.086272 -0.725329
2000-01-04  0.959598  1.296840 -1.868739
2000-01-05  0.115898 -1.240031 -1.615287
2000-01-06 -0.012749  1.930775  1.321410
2000-01-07 -0.029404 -0.186048  1.017959
2000-01-08 -0.174316 -0.079513 -0.393982

In [45]:
df.style

In [46]:
def color_negative_red(val):
    color = 'red' if val < 0 else 'white'
    return 'color: %s' % color

In [47]:
df.style.applymap(color_negative_red)

In [48]:
df.index = pd.to_datetime(df.index, format = '%Y-%m-%d').strftime('%Y-%m-%d')
df.style.applymap(color_negative_red)

In [49]:
def highlight_max(s):
    is_max = s == s.max()
    return ['background-color: blue' if v else '' for v in is_max]

In [50]:
df.style.apply(highlight_max)

In [51]:
df.style.apply(highlight_max, axis=1)

In [52]:
df.style.apply(highlight_max, axis=0)

In [53]:
df.style.apply(highlight_max, axis=0).applymap(color_negative_red)

## Nowe kolumny

In [54]:
df.suma = df.a + df.b + df.c

<ipython-input-54-c0718dcb1519>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.suma = df.a + df.b + df.c

In [55]:
df['suma'] = df.a + df.b + df.c

In [56]:
df

                   a         b         c      suma
2000-01-01 -0.905308 -0.393136 -1.003778 -2.302221
2000-01-02 -0.470104 -0.769813 -0.456002 -1.695919
2000-01-03 -0.560115  0.086272 -0.725329 -1.199172
2000-01-04  0.959598  1.296840 -1.868739  0.387700
2000-01-05  0.115898 -1.240031 -1.615287 -2.739420
2000-01-06 -0.012749  1.930775  1.321410  3.239436
2000-01-07 -0.029404 -0.186048  1.017959  0.802507
2000-01-08 -0.174316 -0.079513 -0.393982 -0.647812

### Zadanie 1

Podsumować dane dla zespołu `Packers` (stworzyć `DataFrame` z danymi tego zespołu)

### Zadanie 2

Dodać do DataFrame `football` kolumnę `games_played`

### Zadanie 3

Dodać do DataFrame `football` kolumnę `percentage_games_won`

## Zadanie 4

Wyświetlić dane dla zespołu `Packers` z lat parzystych